//============================================================================//
//         модуль часто используемых пользовательских типов данных            //
//                  написано Кириллом Черкасовым aka kvche                    //
//============================================================================//
unit typelib;

interface

uses Classes, SysUtils, Windows, Math;

type

//процентный беззнаковый тип данных
  TCent = 0..100;

//процентый тип со знаком
  TSignedCent = -100..100;

//тип парных беззнаковых процентов
  TCentPair = array [0..1] of TCent;

//тип парных процентов со знаком
  TSignedCentPair = array [0..1] of TSignedCent;

//тип парных однобайтовых целых чисел
  TBytePair = array [0..1] of byte;

//тип четырехбайтовых парных целых чисел
  TIntPair = array [0..1] of integer;

//тип строк названий
  TNameStr = string[60];

//тип строк описаний
  TDescrStr = string [200];

implementation

end.
